{"sighted_at": "19950107", "reported_at": "19950107", "location": " McMinnville, TN", "shape": "", "duration": "30 min.", "description": "TN Emergency Management Agency called to report an &quot;event&quot; at 1730 hrs..  Warren Co. Sheriff had received many credible reports about red and blue &quot;roman candle&quot; like objects shooting down out of the sky to the ground.  Then witnesses observed a large red cluster in sky, then two bright clusters.  The latter appeared to explode, and then fall to earth.  One red object appeared to be the largest; green ones were smaller.  They were reported to appear to be descending to the earth slowly, at which point a huge white flash of light occurred. Subsequent reports by investigators suggest that some kind(s) of officials were in the area shortly after event, requesting that local and state officials say nothing.((NUFORC Note:  To the best of our knowledge, this event was not only dramatic, but quite bizarre, as well.  We were first contacted Saturday night, January 7, 1995, by an Operations Officer in TEMA, who reported to us that the event had occurred, and that their offices had been activated, as a result of the strange event, and subsequent explosion.  The latter was so dramatic that a member of the local aviation community, who had witnessed the event, immediately following the explosion, drove to the airport and took off in an aircraft to search for what he was certain had been an airliner that had exploded in midair.  TEMA contacted the U. S. Air Force, apparently informing them that a possible UFO event had occurred, and inquiring what TEMA should do.  According to the TEMA official we spoke with, TEMA was informed by the USAF to contact the National UFO Reporting Center.  TEMA did contact our Center by telephone, and faxed to our offices a seven-page document, written by a Warren County Deputy Sheriff, in which that officer describeded the explosion, according to eyewitnesses. We express our sincere gratitude to TEMA for their effort in sharing the information with our Center. Peter Davenport, Director))", "airport_name": "Louisville International Standiford Field", "airport_distance": 12.962957541417135, "closest_shooting": 13.138474566617804, "shootings_in_state": 8, "shootings_per_year": 5, "closest_hospital_name": "McMinnville, Tennessee OPC", "closest_hospital_distance": 1.101392797422151, "closest_hospital_region": "VISN 9: VA MidSouth Healthcare Network", "average_sentiment": -0.43004115226337447, "average_sentiment_confidence": 0.8983115226337443, "most_popular_airline": "United"}
