{"sighted_at": "19950722", "reported_at": "19950723", "location": " Santa Clara, CA", "shape": "", "duration": "30 min.", "description": "Mr. Peter Davenport National UFO Reporting CenterPO Box 45623, University StationSeattle, WA 98145Dear Peter,Along with my report, I have enclosed a hand-written report from Ben Kwong who witnessed the same UFO&apos;s with me on Saturday, July 22, 1995.  Mr. Kwong is an engineer and lives in San Jose.  I did not get a written report from his 12-year-old son, Michael, but will send it to you if he writes one.  I believe that the reports from Mr. Kwong and myself should be thorough enough.  The only difficulty in writing our reports would be regarding the order in which we saw everything happen.  This is due to the fact that we saw up to five UFO&apos;s (four to five in the air at once).  We were not always looking at the same UFO at the same time.  Since there were several UFO&apos;s in the sky at once during our sighting, we didn&apos;t always focus on the same UFO&apos;s.  Anyway, the following is my accounting of what we saw.  Also, please note that I may have incorrectly given you the time of the sighting as being between 10:30 AM and 11:00 to 11:15.  The time was between 9:30 AM to 10:00 or later.  It was definitely for at least a half hour, maybe an hour (I began teaching my tennis lesson at 9:00 and noticed the first UFO at about 9:30.  When I arrived at home, 2 min. away, it was about 11:00 but I don&apos;t recall watching the UFO&apos;s for more than 45 min. to an hour at the very most -very minimum was a half hour).To whom it may concern:On Saturday, July 22, 1995 at 9:30 AM I, along with Michael Kwong (age 12), and his father (Ben Kwong), had a UFO&apos;s sighting which lasted for at least a half hour (to 10:15 AM or later) over the sky of Santa Clara, CA, from the Marina Playa Apt. complex tennis courts located at 3500 Granada Ave. and Lawrence Expressway (El Camino is a close cross street of Lawrence Expressway).  The sighting first began at 9:30 AM when I was teaching Michael Kwong a tennis lesson.  Michael was practicing his serve and was tossing the ball in the air.  I looked at the ball toss as it went up and noticed that the moon was out.  I also noticed an object by the moon which I took to be a star and appeared stationary like a star.  I looked at the object again and thought it might be moving slowly.  The object appeared to be moving slowly at a very high altitude, perhaps just within the atmosphere or at least at a very high altitude.  I spoke to Michael and began to say things out loud like, &quot;What is that?  What the heck is that?  It&apos;s not an airplane.&quot;  Michael looked up at it as well.  I stopped the lesson out of curiosity to watch this object.  I walked over to the fence and yelled to Ben Kwong, who was sitting in his car reading the newspaper.  I asked him to come out of his car to get a look a the object so we could figure out what it was.  He stood down below the tennis courts, looking up at the object as I and Michael were too.  Then Mr. Kwong came up to the court and all three of us continued to watch the object.  The object looked completely round and whitish in appearance (perhaps due to the altitude or even entering the atmosphere?).  The object slowly moved away from the moon and then curved a slowly headed back toward its original position, and then it appeared to hover and then start to move slowly again.  We watched this object for a few minutes and then we saw another object which looked had the same appearance as the first object.  I don&apos;t remember if Mr. Kwong or I spotted the next object first (Mr. Kwong&apos;s son is near sighted, so he had a harder time seeing).  I believe we watched until finally we saw at least four of the whitish objects in the sky.  At one point it appeared like they were hovering and moving slowly in four corners of the sky.  When they were closer to us, they appeared metallic, sort of a metallic, silver to silver-blue in color.  When they were higher up they initially appeared to be more whitish in color.  Anyway, we continued watching several of these objects as they moved slowly, stop, and move in bizarre paths, unlike airplanes.  They were very high but left no exhaust trail.  They moved and changed direction, unlike weather balloons or satellites.  At some point, after watching the (I&apos;ll call them silver, or metallic-silver/blue) objects, Ben and I noticed a red UFO, completely round like the others, but a metallic-red in color.  We then both observed a silver UFO and the red UFO in a staggered formation, with the silver UFO leading in front to the left of the red UFO (doing what appeared to be the same speed).  We noticed another red object at a lower altitude slowly moving up into the sky (not metallic, but more of an all orange to orange-red in color).  I didn&apos;t, nor did Ben, take much notice of this object as it slowly went up into the sky.  It could have been a balloon and didn&apos;t have the metallic look of the other objects which were very high in the sky.  At some point, the silver UFO&apos;s would just disappear from sight.  I don&apos;t know where they went, maybe out into the upper atmosphere,  Then sometimes one would come back into view.  The red UFO really caught my attention next.  Ben had lost sight of it (you really had to &quot;track&quot; with your eyes without looking away from the UFO&apos;s or it would take a few seconds to find some of them again).  Anyway, I told Ben that I could see the red UFO again.  I saw it moving very slowly up in the sky and then it suddenly shot through the sky at an amazing speed.  I said, &quot; There it goes! There it goes! Look at it go!&quot;  Ben kept saying that he couldn&apos;t find it.  We watched some of the other UFO&apos;s until it seemed that there were no more to see (they had all gone, but we didn&apos;t see them leave).  We had about given up on seeing any more UFO&apos;s up there when I caught sight of the first or perhaps another red UFO.  I told Ben to look up as I pointed to its location.  Ben said he could see it.  Suddenly the red UFO shot across the sky at an amazing speed, much much faster than any jet or rocket could fly (we were watching regular passenger jets crawl across the sky every once in awhile as we watched the UFO&apos;s.  The passenger jets, and some jets which may have been military from Moffet Field, were at a much lower altitude than the UFO&apos;s, a testimony to the speed of the UFO&apos;s).  I kept pointing at the red UFO as it sped across the sky.  We were both in awe, and were both speaking out loud in our amazement of the speed of the object (&quot;There is no way that can be a jet.  Nothing is that fast.  Look at it go.&quot; -etc., etc.).  As I was moving my finger across the sky, tracking the object (in what would take a jet several minutes to travel, I followed the object across the sky in less than ten seconds.  It was still at a very high altitude as well), Ben said he could see a silver UFO right next to the red one.  I said I only could see the red one, but just before the red UFO completely went out of sight, I could see another UFO, a silver one, very close to the red UFO or joined to it.  We were then completely convinced that we saw UFO&apos;s, things which are not man-made.  We didn&apos;t see any more UFO&apos;s for a few minutes, so I resumed my tennis lesson, although I had a very hard time teaching.  We stopped a few minutes later.  I looked up again and saw one lone silver UFO (up so high that it appeared white).  It was hovering and then started to move slowly again.  I told Ben and Michael that there was another one up there.  At this point, we already saw the most exciting part of our sighting (the red UFO &amp; silver UFO shooting off).  Our necks were tired from the strain of looking up, almost straight up at times for over a half hour (possibly an hour or more, as Ben stated, although I can&apos;t be sure).  We really didn&apos;t take much notice of this UFO and we didn&apos;t see it disappear from sight, but it did a couple of minutes later.  We parted between 10:30 and 11:00 AM.  I went back to my apartment and called some TV stations to see if anyone had reported anything (I really thought SOMEONE would have witnessed what we saw and would report it.  The TV station personnel said nobody else called in, plus they seemed rather skeptical of my story.  That annoyed me a bit.  I then called the Air Force in Santa Clara County.  They switched me from command post to command post.  I gave my story up to three times perhaps.  They asked me at what time I saw the UFO&apos;s, took my story, and then said they would transfer me to another command post and to just tell them the same thing (that I told the first people I contacted).  Finally, the Air Force gave me the phone # of the National UFO Reporting Agency (for whom I am writing this report).  I, after giving my story to Peter Davenport, was made aware of the fact that another person in California reported seeing up to five UFO&apos;s on the same day I had my sighting.  This was my first time every seeing anything like this in my life (I&apos;m 29-years-old, teach tennis and am also a computer specialist teaching elementary school.  Ben, like I said, is an engineer.  So I believe we are both credible people).End of ReportI&apos;m waiting to get my grandmother&apos;s written report of her two sightings and my mother&apos;s report of a sighting (these all happened many years ago).  I was afraid to mention their sightings because I thought it might make my sighting less credible.  I indeed immediately felt I had something to share with them and also wanted them to retell of their sightings as well.  My grandmother&apos;s sightings are of particular interest to me since she saw a UFO in the Almaden area of San Jose, CA some 58 years ago.  I teach in this area and my ancestors first settled there in the 1860&apos;s.  Someone emailed me who lives in Almaden to tell me she and her daughter &amp; 14-year-old son had sightings in Almaden.  She said that her son saw one hovering over the school that I teach at.  This was before she even knew that I teach at this school!  Anyway, I don&apos;t know how many people you can believe on the Internet re. sightings, but I know what I saw, and that&apos;s good enough for me.  The only other strange thing I observed in my life was described to me by someone on the Internet as being &quot;ball lightening&quot; or something like it.  I was twelve-years-old at the time.  I don&apos;t know if that is UFO related or not.  Is it just a normal phenomenon.  It happened indoors.  It went under a cot.  The cot shot straight up in the air, about five feet, and there was nothing underneath the cot!  The object was indefinable in shape, just grayish/white, and swirling.  It seemed to react to me as I entered the room and skimmed across the floor.  Any ideas?Sincerely,William D. Baileywbailey@cello.gina.calstate.edu", "airport_name": "Norman Y. Mineta San Jose International Airport", "airport_distance": 30.84513051367399, "closest_shooting": 33.37175948949434, "shootings_in_state": 45, "shootings_per_year": 5, "closest_hospital_name": "San Jose Clinic", "closest_hospital_distance": 19.394028743210264, "closest_hospital_region": "VISN 21: Sierra Pacific Network", "average_sentiment": -0.4105960264900662, "average_sentiment_confidence": 0.8938002483443711, "most_popular_airline": "United"}
